<?php

return [


    /*
    |------------------------------------------------- -------------------------
    | التحقق من صحة خطوط اللغة
    |------------------------------------------------- -------------------------
    |
    | تحتوي أسطر اللغة التالية على رسائل الخطأ الافتراضية التي يستخدمها
    | فئة المدقق. بعض هذه القواعد لها إصدارات متعددة مثل
    | كما قواعد الحجم. لا تتردد في تعديل كل من هذه الرسائل هنا.
    |
    */

    'accepted' => 'The , field يجب قبول حقل.',
    'accepted_if' => 'يجب قبول هذا الحقل عندما يكون :other هو :value.',
    'active_url' => 'يجب أن يكون هذا الحقل عنوان URL صالحًا.',
    'after' => 'يجب أن يحتوي هذا الحقل على تاريخ بعد :date.',
    'after_or_equal' => 'يجب أن يكون هذا الحقل تاريخًا بعد أو يساوي:date.',
    'alpha' => 'يجب أن يحتوي هذا الحقل على أحرف فقط.',
    'alpha_dash' => 'يجب أن يحتوي هذا الحقل فقط على أحرف وأرقام وشرطات وشرطات سفلية.',
    'alpha_num' => 'يجب أن يحتوي هذا الحقل على أحرف وأرقام فقط.',
    'array' => 'يجب أن يكون هذا الحقل مصفوفة.',
    'ascii' => 'يجب أن يحتوي هذا الحقل فقط على أحرف ورموز أبجدية رقمية أحادية البايت.',
    'before' => 'يجب أن يحتوي هذا الحقل على تاريخ قبل :date.',
    'before_or_equal' => 'يجب أن يكون هذا الحقل تاريخًا قبل أو يساوي:date.',
    'between' => [
        'array' => 'يجب أن يحتوي هذا الحقل على ما بين :min و:max من العناصر.',
        'file' => 'يجب أن يكون هذا الحقل بين :min و:max كيلوبايت.',
        'numeric' => 'يجب أن يكون هذا الحقل بين :min و :max.',
        'string' => 'يجب أن يكون هذا الحقل بين :min و:max من الأحرف.',
    ],
     'boolean' => 'يجب أن يكون هذا الحقل صحيحًا أو خطأ.',
     'confirmed' => 'تأكيد هذا الحقل غير متطابق.',
     'current_password' => 'كلمة المرور غير صحيحة.',
     'date' => 'يجب أن يكون هذا الحقل تاريخًا صالحًا.',
     'date_equals' => 'يجب أن يكون هذا الحقل تاريخًا يساوي :date.',
     'date_format' => 'يجب أن يتطابق هذا الحقل مع التنسيق :format.',
     'decimal' => 'يجب أن يحتوي هذا الحقل على منازل عشرية :decimal.',
     'declined' => 'يجب رفض هذا الحقل.',
     'declined_if' => 'يجب رفض هذا الحقل عندما يكون :other هو :value.',
     'different' => 'يجب أن يكون الهذا الحقل و :other مختلفين.',
     'digits' => 'يجب أن يكون هذا الحقل هو :digits digits.',
     'digits_between' => 'يجب أن يكون هذا الحقل بين :min و:max digit.',
     'dimensions' => 'يحتوي الهذا الحقل على أبعاد صورة غير صالحة.',
     'distinct' => 'يحتوي الهذا الحقل على قيمة مكررة.',
     'doesnt_end_with' => 'يجب ألا ينتهي هذا الحقل بأحد القيم التالية: :values.',
     'doesnt_start_with' => 'يجب ألا يبدأ هذا الحقل بأحد العناصر التالية: :values.',
     'email' => 'يجب أن يكون الهذا الحقل عنوان بريد إلكتروني صالحًا.',
     'ends_with' => 'يجب أن ينتهي هذا الحقل بأحد القيم التالية: :values.',
     'enum' => 'السمة :المحددة غير صالحة.',
     'exists' => 'السمة المحددة غير صالحة.',
     'file' => 'يجب أن يكون الهذا الحقل ملفًا.',
     'filled' => 'يجب أن يحتوي الهذا الحقل على قيمة.',
     'gt' => [
    'array' => 'يجب أن يحتوي هذا الحقل على أكثر من :عناصر قيمة.',
    'file' => 'يجب أن يكون هذا الحقل أكبر من القيمة بالكيلوبايت.',
    'numeric' => 'يجب أن يكون هذا الحقل أكبر من :value.',
    'string' => 'يجب أن يكون هذا الحقل أكبر من أحرف القيمة :',
],
     'gte' => [
    'array' => 'يجب أن يحتوي هذا الحقل على عناصر قيمة :أو أكثر.',
    'file' => 'يجب أن يكون هذا الحقل أكبر من أو يساوي القيمة بالكيلوبايت.',
    'numeric' => 'يجب أن يكون هذا الحقل أكبر من أو يساوي :value.',
    'string' => 'يجب أن يكون هذا الحقل أكبر من أو يساوي أحرف القيمة.',
],
     'image' => 'يجب أن يكون هذا الحقل صورة.',
     'in' => 'السمة المحددة غير صالحة.',
     'in_array' => 'يجب أن يكون هذا الحقل موجودًا في :other.',
     'integer' => 'يجب أن يكون هذا الحقل عددًا صحيحًا.',
     'ip' => 'يجب أن يكون الحقل, عنوان IP صالحًا.',
     'ipv4' => 'يجب أن يكون هذا الحقل عنوان IPv4 صالحًا.',
     'ipv6' => 'يجب أن يكون الهذا الحقل عنوان IPv6 صالحًا.',
     'json' => 'يجب أن يكون الحقل, عبارة عن سلسلة JSON صالحة.',
     'lowercase' => 'يجب أن يكون هذا الحقل صغيرًا.',
     'lt' => [
    'array' => 'يجب أن يحتوي هذا الحقل على عناصر أقل من :value.',
    'file' => 'يجب أن يكون هذا الحقل أقل من القيمة بالكيلوبايت.',
    'numeric' => 'يجب أن يكون هذا الحقل أقل من :value.',
    'string' => 'يجب أن يكون هذا الحقل أقل من :value أحرف.',
],
     'LTE' => [
    'array' => 'يجب ألا يحتوي هذا الحقل على أكثر من :عناصر القيمة.',
    'file' => 'يجب أن يكون هذا الحقل أقل من أو يساوي: القيمة بالكيلوبايت.',
    'numeric' => 'يجب أن يكون هذا الحقل أقل من أو يساوي :value.',
    'string' => 'يجب أن يكون هذا الحقل أقل من أو يساوي أحرف القيمة:.',
],
     'mac_address' => 'يجب أن يكون الحقل, عنوان MAC صالحًا.',
     'max' => [
    'array' => 'يجب ألا يحتوي هذا الهذا الحقل على أكثر من :max من العناصر.',
    'file' => 'يجب ألا يكون هذا الحقل أكبر من :max كيلو بايت',
    'numeric' => 'يجب ألا يكون هذا الحقل أكبر من :max.',
    'string' => 'يجب ألا يزيد هذا الحقل عن :max لعدد الأحرف.',
],
     'max_digits' => 'يجب ألا يحتوي هذا الحقل على أكثر من :max digits.',
     'mimes' => 'يجب أن يكون هذا الحقل ملفًا من النوع: :values.',
     'mimetypes' => 'يجب أن يكون هذا الحقل ملفًا من النوع: :values.',
     'min' => [
    'array' => 'يجب أن يحتوي هذا الحقل على عناصر :min على الأقل.',
    'file' => 'يجب أن يكون هذا الحقل على الأقل: دقيقة كيلو بايت.',
    'numeric' => 'يجب أن يكون هذا الحقل :min على الأقل.',
    'string' => 'يجب أن يحتوي هذا الحقل على الأقل على :min من الأحرف.',
],
     'min_digits' => 'يجب أن يحتوي هذا الحقل على الأقل:min digits.',
     'missing' => 'يجب أن يكون هذا الحقل مفقودًا.',
     'missing_if' => 'يجب أن يكون الهذا الحقل مفقودًا عندما يكون :other هو :value.',
     'missing_unless' => 'يجب أن يكون الهذا الحقل مفقودًا ما لم يكن :other هو :value.',
     'missing_with' => 'يجب أن يكون هذا الحقل مفقودًا عند وجود :values.',
     'missing_with_all' => 'يجب أن يكون هذا الحقل : مفقودًا عند وجود القيم :.',
     'multiple_of' => 'يجب أن يكون الهذا الحقل من مضاعفات :value.',
     'not_in' => 'السمة المحددة غير صالحة.',
     'not_regex' => 'تنسيق هذا الحقل غير صالح.',
     'numeric' => 'يجب أن يكون هذا الحقل رقمًا.',
     'password' => [
    'letters' => 'يجب أن يحتوي هذا الحقل على حرف واحد على الأقل.',
    'mixed' => 'يجب أن يحتوي هذا الحقل على حرف كبير واحد وحرف صغير واحد على الأقل.',
    'numbers' => 'يجب أن يحتوي هذا الحقل على رقم واحد على الأقل.',
    'symbols' => 'يجب أن يحتوي هذا الحقل على رمز واحد على الأقل.',
    'uncompromised' => 'ظهرت السمة المحددة في تسرب البيانات. يرجى اختيار سمة مختلفة.',
],
     'present' => 'يجب أن يكون هذا الحقل موجودًا.',
     'prohibited' => 'هذا الحقل محظور.',
     'prohibited_if' => 'يُمنع الهذا الحقل عندما تكون القيمة :other هي :value.',
     'prohibited_unless' => 'الهذا الحقل محظور ما لم يكن :other موجودًا في :values.',
     'prohibits' => 'يمنع الهذا الحقل :other من التواجد.',
     'regex' => 'تنسيق هذا الحقل غير صالح.',
     'required' => 'هذا الحقل  مطلوب.',
     'required_array_keys' => 'يجب أن يحتوي هذا الحقل على إدخالات لـ: :values.',
     'required_if' => 'يكون الهذا الحقل مطلوبًا عندما يكون :other هو :value.',
     'required_if_accepted' => 'الهذا الحقل مطلوب عند قبول :other.',
     'required_unless' => 'الهذا الحقل مطلوب ما لم يكن :other موجودًا في :values.',
     'required_with' => 'الهذا الحقل مطلوب عند وجود :values.',
     'required_with_all' => 'الهذا الحقل مطلوب عند وجود القيم :.',
     'required_without' => 'الحقل, مطلوب عندما لا تكون القيم: موجودة.',
     'required_without_all' => 'الهذا الحقل مطلوب في حالة عدم وجود أي من :القيم.',
     'same' => 'يجب أن يتطابق هذا الحقل مع :other.',
     'size' => [
    'array' => 'يجب أن يحتوي هذا الحقل على عناصر :size.',
    'file' => 'يجب أن يكون هذا الحقل بالحجم بالكيلوبايت.',
    'numeric' => 'يجب أن يكون هذا الحقل :size.',
    'string' => 'يجب أن يكون هذا الحقل :أحرف بالحجم.',
],
     'starts_with' => 'يجب أن يبدأ هذا الحقل بأحد القيم التالية: :values.',
     'string' => 'يجب أن يكون الحقل, عبارة عن سلسلة.',
     'timezone' => 'يجب أن يكون الهذا الحقل منطقة زمنية صالحة.',
     'unique' => 'هذه البيانات موجودة مسبقا',
     'uploaded' => 'فشل تحميل السمة:',
     'uppercase' => 'يجب أن يكون هذا الحقل كبيرًا.',
     'url' => 'يجب أن يكون هذا الحقل عنوان URL صالحًا.',
     'ulid' => 'يجب أن يكون هذا الحقل ULID صالحًا.',
     'uuid' => 'يجب أن يكون هذا الحقل UUID صالحًا.',
    'english letters'=>'هذا الحقل يجب ان يحتوي على أحرف إنجليزية فقط',
    'arabic letters'=>'هذا الحقل يجب ان يحتوي على أحرف عربية فقط',
    'at lease select one subject'=>'يجب عليك تحديد مادة واحدة للمدرس على الأقل',

    /*
    |------------------------------------------------- -------------------------
    | خطوط لغة التحقق المخصصة
    |------------------------------------------------- -------------------------
    |
    | هنا يمكنك تحديد رسائل التحقق المخصصة للسمات باستخدام
    | اصطلاح "attribute.rule" لتسمية الأسطر. وهذا يجعلها سريعة
    | تحديد لغة مخصصة محددة ل
ine لقاعدة سمة معينة.
    |
    */

     'custom' => [
    "attribute-name" => [
        'rule-name' => 'رسالة مخصصة',
         ],
     ],

     /*
     |------------------------------------------------- -------------------------
     | سمات التحقق المخصصة
     |------------------------------------------------- -------------------------
     |
     | يتم استخدام أسطر اللغة التالية لتبديل العنصر النائب للسمة الخاصة بنا
     | باستخدام شيء أكثر سهولة في القراءة مثل "عنوان البريد الإلكتروني" بدلاً من ذلك
     | من "البريد الإلكتروني". وهذا يساعدنا ببساطة على جعل رسالتنا أكثر تعبيرًا.
     |
     */

     'attributes' => [],

];
